{
  "_class_name": "StableCascadeUnet",
  "_diffusers_version": "0.26.0.dev0",
  "_name_or_path": "StableCascade/decoder",
  "block_repeat": [
    [
      1,
      1,
      1,
      1
    ],
    [
      3,
      3,
      2,
      2
    ]
  ],
  "blocks": [
    [
      2,
      6,
      28,
      6
    ],
    [
      6,
      28,
      6,
      2
    ]
  ],
  "c_clip_img": null,
  "c_clip_seq": 4,
  "c_clip_text": null,
  "c_clip_text_pooled": 1280,
  "c_cond": 1280,
  "c_effnet": 16,
  "c_hidden": [
    320,
    640,
    1280,
    1280
  ],
  "in_channels": 4,
  "c_out": 4,
  "c_pixels": 3,
  "c_r": 64,
  "dropout": [
    0,
    0,
    0.1,
    0.1
  ],
  "kernel_size": 3,
  "level_config": [
    "CT",
    "CT",
    "CTA",
    "CTA"
  ],
  "nhead": [
    -1,
    -1,
    20,
    20
  ],
  "patch_size": 2,
  "self_attn": true,
  "switch_level": null,
  "t_conds": [
    "sca"
  ]
}
